/*
 *   프로그램
 *      평문/조건문/반복문
 *      => 모든 프로그램 언어: 변수, 연산자, 제어문
 *         배열 => 변수 여러 개를 묶어서 관리
 *         메소드 => 연산자+제어문
 *         클래스 => 변수+연산자+제어문
 *         라이브러리 => 제작 완료
 *   1. 제어문
 *      조건문: 조건에 맞는 내용 출력
 *        = 단일 조건문 => true일 때만 처리
 *        = 선택 조건문(***) => true/false 나눠서 처리
 *        = 다중 조건문 => true일 때 처리, false일 때 다른 조건 선택 후 한 개의 문장만 수행
 *      선택문  
 *      반복문
 *      반복제어문
 */
public class 단일조건문_정리 {

	public static void main(String[] args) {
		// TODO Auto-generated method stub

	}

}
