package com.sist.main;
/*
 *   언어: 자바, 파이썬, c/c++, c#, 코틀린, 스칼라...
 *       ----------
 *   ML: HTML, XML, WML, HDML, VML
 *       ---------
 *   Javascript: Jquery(AJax), Vue, React, TypeScript, coffieScript, NodeJs, NextJS
 *               ------------------------
 *   기술: Spring, Spring-Boot
 *   구조: AWS/MSA
 *   ----------------------------------------
 *     => R, Numpy, Pandas => 아나콘다, MatPlotLib
 *     => 머신러닝/딥러닝
 *   IT => 전진 => 앞만 보고 => 모르는 부분만 공부
 *   =====> 실무 구현(이론:면접)
 *   자바
 *     = 데이터형 => 변수(2장)
 *        정수: byte, int,      long
 *            -----            ----
 *              | 파일 입출력(io)   | 데이터분석(빅데이터)
 *        실수: double
 *        논리형: boolean
 *        문자열: String
 *     = 처리 => 연산자/제어문(3장, 4장)
 *        단항연산자: 증가연산자(++, --), !(부정연산자), (type) 형변환
 *                 형변환: 자동형변환, 강제형변환
 *                 ---- 클래스도 적용
 *                      ---- 크기(상속, 포함) => instanceof
 *        이항연산자: 산술연산자(+, -, *, /, %)
 *                 비교연산자(==, !=, <, >, <=, >=)
 *                 논리연산자(&&, ||)
 *                 대입연산자(=, +-=, -=)
 *        삼항연산자: ? :
 *        
 *        제어문
 *          = 조건문
 *             if(조건문) => 단일 조건문
 *             if~else => 선택 조건문
 *             if~else if~else => 다중 조건문
 *          = 반복문
 *            for(화면 출력), while(데이터베이스, 파일)
 *            Front        Back
 *          = 반복제어문
 *            break => 반복문 종료
 *     = 배열 => 1차원
 *              => 클래스 배열
 *              Music[] String[] ==> 컬렉션(배열 보완)
 *                                   ---- 12장(핵심)
 *     = 클래스(5, 6, 7장)
 *       구성요소
 *       -----
 *        멤버변수
 *          = 인스턴스 변수(중심) ===> 메모리에 따로 저장
 *          = static 변수 ===> 메모리 공간을 한 개만 사용
 *            ----------
 *             => 디자인패턴: 싱글턴 패턴 => 데이터베이스 연동
 *             => 팩토리패턴
 *             => 스프링 => 8개 패턴(컴바인드 패턴)
 *          = 데이터 보호 => 캡슐화 => private => 읽기/쓰기
 *                        getter/setter
 *        메소드
 *          = 다른 클래스와 연결
 *          = 인스턴스 메소드 : 메모리에 따로 저장
 *            => 호출
 *               객체명.메소드()
 *               scan.next()
 *          = static 메소드 : 공유(한 개의 메소드로 모든 객체 사용)
 *               클래스명.메소드()
 *               Math.random()
 *               String.valueOf()
 *               
 *            => 한글변환
 *            
 *            => 메소드
 *               접근지정어: public
 *               리턴형: 기본형, 클래스형, 배열
 *                  => 결과값 1개
 *                  => 목록, 상세보기, 검색결과 => 배열, 클래스
 *               메소드명: 식별자 => 소문자 시작
 *               매개변수: 여러 개 사용 => 사용자 요청값
 *                      3개 이상이면 클래스, 배열
 *                      
 *        생성자
 *         = 멤버변수 초기화, 시작과 동시에 처리
 *         = 메모리 할당 시 호출
 *         = 클래스는 무조건 생성자 한 개 이상이 필요
 *           => 없는 경우에는 자동으로 한 개 추가(디폴트 생성자)
 *         *** 자동 추가 ***
 *          1) import 자동 추가
 *             import java.lang.*
 *                    --------- String, Math, Object, System
 *          2) 모든 클래스(라이브러리, 사용자 정의 클래스)
 *             => 상속(Object)
 *             class MainClass (extends Object)
 *          3) 모든 메소드는 return(메소드 종료)
 *             => void일 경우에는 자동 return이 추가
 *             void aaa()
 *             {
 *                 // return;
 *             }
 *          4) class A
 *             {
 *                 -------
 *                 public A(){}
 *                 -------
 *             }
 *          5) 자바에서 지원하는 모든 클래스는 예외처리
 *             CheckException UnCheckException
 *                            ---------------- 예외처리 생략
 *                   |
 *             네트워크: URL, Socket...
 *             IO: 파일 입출력
 *             SQL: 오라클 연결
 *             
 *          생성자를 사용하지 않고 초기화 방법
 *          ------------------------
 *            초기화 블록
 *            = 인스턴스 블록 => 생성자
 *            = static 블록 => static 변수 => 생성자를 호출하지 않아도 됨
 *            
 *            *** 먼저 명시적 초기화 => 불가능(생성자, 초기화 블록) ***
 *                                  | 외부에서 값을 읽어서 초기화
 *                                  | 크롤링, 파일, 네트워크...
 *     = 6장: 객체지향 3대 특성
 *           = 문법이 아님, 권장 사항
 *       1) 캡슐화: 데이터 보호
 *          => 변수를 은닉화: private
 *          => 기능 설정 => getter/setter => Lombok
 *       2) 재사용: 상속 => 기존의 클래스를 확장, 필요시 변경
 *                       class A
 *                       class B extends A
 *                       포함 => 클래스를 변경하지 않는 상태로 사용
 *                       class A
 *                       class B
 *                       {
 *                           A a=new A(); ==> 강제 변경 => 익명의 클래스
 *                       }
 *                       
 *                       상속의 예외 조건: static
 *                                    생성자, 초기화 블록
 *                                    private => 상속은 되지만 접근 불가
 *                       상속 => 클래스의 크기 => 형변환
 *                         자동 형변환 => 묵시적 형변환
 *                           A a=new B();
 *                           ------------
 *                           B b=new B();
 *                           A a=b;
 *                         강제 형변환 => 명시적 형변환
 *                           A a=new B();
 *                           B b=(B)a;
 *                           ------------
 *                           리턴형 => 클래스형
 *                            => 라이브러리에서 클래스형을 리턴
 *                               ---------------------
 *                                => Object를 리턴하는 경우가 많이 있음
 *                           Music getData(){}
 *       3) 변경/추가
 *          => 다형성
 *          변경: 오버라이딩
 *          추가: 오버로딩
 *          
 *             메소드 관련
 *                  오버로딩              오버라이딩
 *        --------------------------------------------
 *        상태      같은 클래스           상속을 받은 경우
 *        --------------------------------------------
 *        리턴형     관계없음                 동일
 *        --------------------------------------------
 *        메소드명      동일                 동일     
 *        --------------------------------------------
 *        매개변수   개수나 데이터형이 다름        동일
 *        --------------------------------------------
 *        접근지정어   관계없음             축소(X), 확대(O)
 *        --------------------------------------------
 *          private < default < protected < public
 *          
 *        interface A
 *        {
 *            (public abstract) void disp();
 *            (public abstract) void aaa();
 *        }
 *        
 *        => class B implements A
 *        {
 *             void disp(){}
 *             void aaa(){}
 *             ------------- 오류(public에서 default로 축소가 됐기 때문)
 *        }
 */
import java.util.*;
/*
 *   class A
 *   {
 *       void display(){}
 *   }
 *   class B extends A
 *   {
 *       int a, b;
 *       void aaa(){}
 *       ----------------
 *       void display(){} => 변경(오버라이딩)
 *       ----------------
 *   }
 *   
 *   A a=new B();
 *   --- a.display()
 *   B b=new B();
 *   --- a, b, aaa(), display()
 */
public class MainClass {

	public static void main(String[] args) {
		// TODO Auto-generated method stub
		List names=new ArrayList();
		// 배열 대신 사용
		names.add("홍길동");
		String name=(String)names.get(0);
	}

}
